<script setup>
  import { RouterLink } from 'vue-router';
</script>

<template>
  <div class="wrapper">
    <header class="header">Речной транпорт Москвы</header>
    <img src="../assets/rivership.jpg" alt="" class="image">
    <span class="text">
      Московский речной транспорт является одним из ключевых элементов инфраструктуры города. Развитие речного транспорта в Москве началось еще в XV веке, когда Дмитрий Донской открыл первую верфь на реке Москве. В XVIII веке Москва стала важным торговым центром, и ее речной транспорт стал развиваться в соответствии с этим. В последующие годы были построены новые причалы, реконструированы и расширены набережные, построены новые корабли.

      Сегодня Московский речной транспорт продолжает развиваться, хотя его активное использование наблюдалось в период пандемии, когда многие жители Москвы выбрали этот вид транспорта для ежедневных поездок. В 2021 году были введены новые перевозки на быстрых катерах, таких как "Водник 60". Московские власти планируют дальнейшее развитие речного транспорта, указывая на возможность использования реки не только для транспортировки людей, но и для перевозки грузов.

      Однако, также есть некоторые проблемы, связанные с развитием Московского речного трапорта. Недостатки в работе причалов, недостаточное количество маршрутов и высокие цены на билеты являются лишь некоторыми из них. Несмотря на это, Московский речной транспорт остается одним из наиболее экологичных и удобных способов передвижения по городу, и его перевозки, скорее всего, будут продолжать развиваться в будущем.
    </span>
    <RouterLink to="/ships" class="link">Здесь вы можете посмотреть наши модели кораблей.</RouterLink>
  </div>
</template>

<style>
  .wrapper {
    display: flex;
    justify-content: center;
    align-items: center;
    flex-wrap: wrap;
    width: 100%;
    gap: 50px;
  }
  .header {
    width: 100%;
    text-align: center;
    font-size: 64px;
    font-weight: 500;
  }
  .text {
    width: 50%;
    font-size: 20px;
    text-align: justify;
  }
  .image {
    width: 50%;
    border-radius: 15px;
  }
  .link {
    width: 100%;
    text-align: center;
    font-size: 18px;
  }
  @media screen and (max-width: 600px) {
    .header {
      font-size: 30px;
    }
    .image {
      width: 100%;
    }
    .text {
      width: 100%;
    }
  }
</style>